
## :white_check_mark: Apply Succeeded (koyashiro.live)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789311921)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.txt_dmarc: Refreshing state... [id=650e1f15d10efe470b88eece8d3d1aa1]
cloudflare_record.a_root: Refreshing state... [id=e1a783275516e1f83ff07f4ca273eeb5]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=e6b39af7f2fb61e83054f98a9aba3b4b]
cloudflare_record.txt_spf: Refreshing state... [id=1590a0936e741cef6684a2b7b8c00f8f]
cloudflare_record.txt_dkim: Refreshing state... [id=b31bac6bcce999e718d39fd2b2586d48]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.aaaa_root will be created
  + resource "cloudflare_record" "aaaa_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "AAAA"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
cloudflare_record.aaaa_root: Creating...
cloudflare_record.aaaa_root: Creation complete after 0s [id=15a25badd182a760e515adef7d0b9596]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":169,"Program":"tfcmt","SHA1":"cf9351f2f185f12d4678631e1ded38a5bb38a96d","Target":"koyashiro.live","Vars":{},"WorkflowName":"terraform"} -->